In [1]:
import pandas as pd
import numpy as np

In [2]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data, index= labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [8]:
df.iloc[0:4,0:2]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN

In [11]:
df.loc['a':'c','name':'score']

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5

In [12]:
#Write a Pandas program to get list from DataFrame column headers.

In [15]:
list(df.columns.values)

['name', 'score', 'attempts', 'qualify']

In [16]:
#Write a Pandas program to rename columns of a given DataFrame

In [23]:
a = np.arange(1,10).reshape(3,3)
df = pd.DataFrame(a, columns=['COL1','COL2','COL3'])
df

   COL1  COL2  COL3
0     1     2     3
1     4     5     6
2     7     8     9

In [30]:
s1=np.random.randint(10, size = 5)
s2=np.random.randint(10, size = 5)
s3=np.random.randint(10, size = 5)
sozluk = {'var1':s1,'var2':s2,'var3':s3}
df1=pd.DataFrame(sozluk)
df1

   var1  var2  var3
0     1     9     7
1     7     5     0
2     0     5     7
3     9     3     4
4     5     7     1

In [31]:
s = np.random.randint(1,30, size=(10,3))
df2= pd.DataFrame(s, columns= ['age','bge','cge'])
df2

   age  bge  cge
0    1   17   13
1   26   12   12
2   12   13    6
3    4   18   17
4    7   17   10
5   12    1   12
6   18   27    7
7   25   28    5
8   26    8   22
9    3   19   27

In [49]:
a = np.arange(1,10).reshape(3,3)
df = pd.DataFrame(a, columns=['COL1','COL2','COL3'])
df

   COL1  COL2  COL3
0     1     2     3
1     4     5     6
2     7     8     9

In [50]:
df = df.rename(columns ={'COL1':'col1','COL2':'col2','COL3':'col3'})
df

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

In [ ]:
#Write a Pandas program to select rows from a given DataFrame based on values in some columns

In [86]:
s = np.random.randint(1,5, size=(5,3))
df1 = pd.DataFrame(s, columns = ['col1', 'col2', 'col3'])
df1

   col1  col2  col3
0     4     1     3
1     4     2     2
2     2     1     4
3     3     2     4
4     2     4     2

In [65]:
df.loc[df['col1'] == '4']

C:\Users\orhna\anaconda3\lib\site-packages\pandas\core\ops\array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [61]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print('Rows for colum1 value == 4')
print(df.loc[df['col1'] == 4])

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
Rows for colum1 value == 4
   col1  col2  col3
1     4     5     8
3     4     7     0

In [63]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
df.loc[df['col3']==8]

   col1  col2  col3
1     4     5     8

In [ ]:
# Write a Pandas program to change the order of a DataFrame columns

In [87]:
df1

   col1  col2  col3
0     4     1     3
1     4     2     2
2     2     1     4
3     3     2     4
4     2     4     2

In [160]:
df1[['col1', 'col2', 'col3']] = df1[['col3', 'col1', 'col2']]
df1

                           col1  col2  col3
0 1970-01-01 00:00:00.000000007     1     4
1 1970-01-01 00:00:00.000000008     4     5
3 1970-01-01 00:00:00.000000000     4     7

In [ ]:
# Write a Pandas program to add one row in an existing DataFrame

In [91]:
new_row={'col3':2,'col1':2,'col2':3}
df1 = df1.append(new_row, ignore_index=True)
df1

   col1  col2  col3
0     4     1     3
1     4     2     2
2     2     1     4
3     3     2     4
4     2     4     2
5     2     3     2
6     2     3     2

In [ ]:
#Write a Pandas program to write a DataFrame to CSV file using tab separator

In [5]:
df.to_csv('new_file.csv', sep='\t', index=False)
new_df = pd.read_csv('new_file.csv')
new_df

  name\tscore\tattempts\tqualify
0        Anastasia\t12.5\t1\tyes
1               Dima\t9.0\t3\tno
2        Katherine\t16.5\t2\tyes
3                 James\t\t3\tno
4              Emily\t9.0\t2\tno
5          Michael\t20.0\t3\tyes
6          Matthew\t14.5\t1\tyes
7                 Laura\t\t1\tno
8              Kevin\t8.0\t2\tno
9            Jonas\t19.0\t1\tyes

In [ ]:
#Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).

In [14]:
df['city'] = df['attempts'].map({1: 'California', 2: 'Georgia',3:'LosAngeles' })

In [16]:
g1 = df.groupby(["city"]).size().reset_index(name='Number of people')
g1

         city  Number of people
0  California                 4
1     Georgia                 3
2  LosAngeles                 3

In [ ]:
#Write a Pandas program to delete DataFrame row(s) based on given column value.

In [25]:
df.drop('d',axis = 0)

KeyError: "['d'] not found in axis"

In [26]:
df

        name  score  attempts qualify        city
a  Anastasia   12.5         1     yes  California
b       Dima    9.0         3      no  LosAngeles
c  Katherine   16.5         2     yes     Georgia
e      Emily    9.0         2      no     Georgia
f    Michael   20.0         3     yes  LosAngeles
g    Matthew   14.5         1     yes  California
h      Laura    NaN         1      no  California
i      Kevin    8.0         2      no     Georgia
j      Jonas   19.0         1     yes  California

In [35]:
#Write a Pandas program to widen output display to see more columns

In [33]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df1 = pd.DataFrame(data=d)
pd.set_option('display.max_rows', 1100)
pd.set_option('display.max_columns', 5000)
pd.set_option('display.width', 1500)

In [34]:
df1

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [36]:
#Write a Pandas program to select a row of series/dataframe by given integer index.

In [46]:
df1.iloc[2:3,0:3]

   col1  col2  col3
2     3     6     9

In [51]:
df1.iloc[[2]]

   col1  col2  col3
2     3     6     9

In [ ]:
#Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [58]:
df['score']= df['score'].replace(np.nan,0)
df

        name  score  attempts qualify        city
a  Anastasia   12.5         1     yes  California
b       Dima    9.0         3      no  LosAngeles
c  Katherine   16.5         2     yes     Georgia
e      Emily    9.0         2      no     Georgia
f    Michael   20.0         3     yes  LosAngeles
g    Matthew   14.5         1     yes  California
h      Laura    0.0         1      no  California
i      Kevin    8.0         2      no     Georgia
j      Jonas   19.0         1     yes  California

In [59]:
df =  df.fillna(0) #second method

In [ ]:
#Write a Pandas program to convert index in a column of the given dataframe

In [61]:
df.index = df['attempts']

In [67]:
df.drop('attempts', axis=1)

               name  score qualify        city
attempts
1         Anastasia   12.5     yes  California
3              Dima    9.0      no  LosAngeles
2         Katherine   16.5     yes     Georgia
2             Emily    9.0      no     Georgia
3           Michael   20.0     yes  LosAngeles
1           Matthew   14.5     yes  California
1             Laura    0.0      no  California
2             Kevin    8.0      no     Georgia
1             Jonas   19.0     yes  California

In [115]:
df.reset_index(drop=True)

        name  score  attempts qualify
0  Anastasia   12.5       1.0     yes
1       Dima    9.0       3.0      no
2  Katherine   16.5       2.0     yes
3      James    NaN       3.0      no
4      Emily    9.0       2.0      no
5    Michael   20.0       3.0     yes
6    Matthew   14.5       1.0     yes
7      Laura    NaN       1.0      no
8      Kevin  100.0       2.0      no
9      Jonas   19.0       1.0     yes

In [ ]:
#Write a Pandas program to set a given value for particular cell in  DataFrame using index value

In [94]:
df.at[8.0, 'score'] = 100

In [95]:
df

          name  score  attempts qualify
0.0  Anastasia   12.5       1.0     yes
1.0       Dima    9.0       3.0      no
2.0  Katherine   16.5       2.0     yes
3.0      James    NaN       3.0      no
4.0      Emily    9.0       2.0      no
5.0    Michael   20.0       3.0     yes
6.0    Matthew   14.5       1.0     yes
7.0      Laura    NaN       1.0      no
8.0      Kevin  100.0       2.0      no
9.0      Jonas   19.0       1.0     yes
NaN        NaN  100.0       NaN     NaN

In [99]:
df.drop(np.nan,axis=0, inplace=True)

In [100]:
df

          name  score  attempts qualify
0.0  Anastasia   12.5       1.0     yes
1.0       Dima    9.0       3.0      no
2.0  Katherine   16.5       2.0     yes
3.0      James    NaN       3.0      no
4.0      Emily    9.0       2.0      no
5.0    Michael   20.0       3.0     yes
6.0    Matthew   14.5       1.0     yes
7.0      Laura    NaN       1.0      no
8.0      Kevin  100.0       2.0      no
9.0      Jonas   19.0       1.0     yes

In [ ]:
#Write a Pandas program to count the NaN values in one or more columns in

In [106]:
count = df.isna().sum()
print(count)

name        0
score       2
attempts    0
qualify     0
dtype: int64

In [105]:
print(df.isnull().values.sum())

2

In [ ]:
#Write a Pandas program to drop a list of rows from a specified DataFrame

In [107]:
df1

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [112]:
df1.drop([1,3])

   col1  col2  col3
0     1     4     7
2     3     6     9
4     5     8     1

In [121]:
df1 = df1.drop(df1.index[[2,4]])

In [122]:
df1

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

In [ ]:
#Write a Pandas program to reset index in a given DataFrame

In [123]:
df.reset_index(drop=True)

        name  score  attempts qualify
0  Anastasia   12.5       1.0     yes
1       Dima    9.0       3.0      no
2      James    NaN       3.0      no
3    Michael   20.0       3.0     yes
4    Matthew   14.5       1.0     yes
5      Laura    NaN       1.0      no
6      Kevin  100.0       2.0      no
7      Jonas   19.0       1.0     yes

In [127]:
df.drop([0,1],inplace=True)

In [129]:
df

        name  score  attempts qualify
3.0    James    NaN       3.0      no
5.0  Michael   20.0       3.0     yes
6.0  Matthew   14.5       1.0     yes
7.0    Laura    NaN       1.0      no
8.0    Kevin  100.0       2.0      no
9.0    Jonas   19.0       1.0     yes

In [128]:
df.reset_index(drop=True)

      name  score  attempts qualify
0    James    NaN       3.0      no
1  Michael   20.0       3.0     yes
2  Matthew   14.5       1.0     yes
3    Laura    NaN       1.0      no
4    Kevin  100.0       2.0      no
5    Jonas   19.0       1.0     yes

In [ ]:
#Write a Pandas program to combining two series into a DataFrame.

In [140]:
s1 = pd.Series([100,200, 'python', 400, 500])
s2 = pd.Series([600,9000, 'python', 20000, 5000])
df2 = pd.concat([s1,s2],axis = 1)

In [141]:
df2

        0       1
0     100     600
1     200    9000
2  python  python
3     400   20000
4     500    5000

In [ ]:
#Write a Pandas program to shuffle a given DataFrame rows

In [143]:
df.reset_index(drop=True)

      name  score  attempts qualify
0    James    NaN       3.0      no
1  Michael   20.0       3.0     yes
2  Matthew   14.5       1.0     yes
3    Laura    NaN       1.0      no
4    Kevin  100.0       2.0      no
5    Jonas   19.0       1.0     yes

In [144]:
df.sample(frac=1)

        name  score  attempts qualify
9.0    Jonas   19.0       1.0     yes
3.0    James    NaN       3.0      no
7.0    Laura    NaN       1.0      no
6.0  Matthew   14.5       1.0     yes
5.0  Michael   20.0       3.0     yes
8.0    Kevin  100.0       2.0      no

In [ ]:
#Write a Pandas program to convert DataFrame column type from string to datetime

In [146]:
df1

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

In [151]:
import datetime as dt
df1["col3"] = df1["col3"].apply(pd.to_datetime)
df1

   col1  col2                          col3
0     1     4 1970-01-01 00:00:00.000000007
1     4     5 1970-01-01 00:00:00.000000008
3     4     7 1970-01-01 00:00:00.000000000

In [166]:
df1['coldate'] = ['3/11/2000', '3/12/2000', '3/13/2000']

In [168]:
df1['coldate'] =df1["coldate"].apply(pd.to_datetime)

In [169]:
df1

                           col1  col2  col3    coldate
0 1970-01-01 00:00:00.000000007     1     4 2000-03-11
1 1970-01-01 00:00:00.000000008     4     5 2000-03-12
3 1970-01-01 00:00:00.000000000     4     7 2000-03-13

In [152]:
#another example

In [153]:
import pandas as pd
import numpy as np
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
print("String Date:")
print(s)
r = pd.to_datetime(pd.Series(s))
df = pd.DataFrame(r)
print("Original DataFrame (string to datetime):")
print(df)

String Date:
0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object
Original DataFrame (string to datetime):
           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

In [ ]:
# Write a Pandas program to rename a specific column name in a given DataFrame.

In [171]:
df1.rename(columns={'col2':'Column2'})

                           col1  Column2  col3    coldate
0 1970-01-01 00:00:00.000000007        1     4 2000-03-11
1 1970-01-01 00:00:00.000000008        4     5 2000-03-12
3 1970-01-01 00:00:00.000000000        4     7 2000-03-13

In [ ]:
#Write a Pandas program to get a list of a specified column of a DataFrame.

In [173]:
df1['col3'].tolist()

[4, 5, 7]

In [ ]:
#Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers

In [186]:
s1=np.zeros(15)
s2=np.zeros(15)

dfz = pd.DataFrame({'column2':s1, 'column3':s2})

In [192]:
import pandas
import numpy
dtype = [('Column1','int32'), ('Column2','float32'), ('Column3','float32')]
values = numpy.zeros(15, dtype=dtype)
index = ['Index'+str(i) for i in range(1, len(values)+1)]
df = pandas.DataFrame(values, index=index)
print(df)

         Column1  Column2  Column3
Index1         0      0.0      0.0
Index2         0      0.0      0.0
Index3         0      0.0      0.0
Index4         0      0.0      0.0
Index5         0      0.0      0.0
Index6         0      0.0      0.0
Index7         0      0.0      0.0
Index8         0      0.0      0.0
Index9         0      0.0      0.0
Index10        0      0.0      0.0
Index11        0      0.0      0.0
Index12        0      0.0      0.0
Index13        0      0.0      0.0
Index14        0      0.0      0.0
Index15        0      0.0      0.0

In [ ]:
# Write a Pandas program to find the row for where the value of a given column is maximum

In [224]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("Row where col1 has maximum value:")
print(df['col1'].argmax())
print("Row where col2 has maximum value:")
print(df['col2'].argmax())
print("Row where col3 has maximum value:")
print(df['col3'].argmax())

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11
Row where col1 has maximum value:
4
Row where col2 has maximum value:
3
Row where col3 has maximum value:
2

In [225]:
m= np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [227]:
dff = pd.DataFrame(m, columns = ['var1','var2','var3'])
dff

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [234]:
dff.columns=('deg1','deg2','deg3')

In [235]:
dff

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [239]:
dff.index = ('a','b','c')

In [240]:
dff

   deg1  deg2  deg3
a     1     2     3
b     4     5     6
c     7     8     9

In [241]:
dff

   deg1  deg2  deg3
a     1     2     3
b     4     5     6
c     7     8     9

In [242]:
dff.drop(['a', 'c'], axis=0)

   deg1  deg2  deg3
b     4     5     6

In [243]:
dff

   deg1  deg2  deg3
a     1     2     3
b     4     5     6
c     7     8     9

In [254]:
dff.iloc[0:2]['deg1':'deg2']

Empty DataFrame
Columns: [deg1, deg2, deg3]
Index: []